Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level2_source2.tmx
Source language: en_us
Languages: ja

source: Migration experiences differ depending on your existing codebase, but here are some general steps and tools to help you troubleshoot the process:
ja: 以降体験はあなたの既存のコード基盤に依存して異なります、しかしここにその過程の問題をあなたが解決する助けとなるいくつかの一般的な段階とツールがあります。

source: Mirrors also provide a “display style” property that suggests how this mirror might be rendered.
ja: ミラーはまた、「display style」プロパティを提供します、それはどのようにこのミラーが描画されるかを提案します。

source: Multiplies two values and produces their product.
ja: ２つの値を乗算してそれらの積を生成します。

source: Multiplies two values and stores the result in the left-hand-side variable, wrapping any overflow.
ja: ２つの値を乗算して結果を左手側の変数に格納します、あらゆるオーバーフローをラップします。

source: Multiplies two values and stores the result in the left-hand-side variable.
ja: ２つの値を乗算して、結果を左手側の変数に格納します。

source: Must be non-zero.
ja: 非ゼロでなければなりません。

source: MutableCollection Implementations
ja: MutableCollection 実装

source: Negative values are returned in two’s complement representation, regardless of the type’s underlying implementation.
ja: 負の値が、２の補数表現において返されます、その型のもつ基礎となる実装に関係なく。

source: Never call finalize() on hasher.
ja: finalize()をhasher上で決して呼び出さないでください。

source: Next, create unique options as static properties of your custom type using unique powers of two (1, 2, 4, 8, 16, and so forth) for each individual property’s raw value so that each property can be represented by a single bit of the type’s raw value.
ja: 次に、それぞれが特有なオプションをあなたのあつらえの型の静的プロパティとして作成してください、特有な２の冪（1、2、4、8、16、およびそれ以降）を各個別プロパティの生の値に対して使います、それで各プロパティはその型のもつ生の値からなるある単一ビットによって表されることができます。

source: Next, the while loop calls the iterator’s next() method repeatedly, binding each element that is returned to animal and exiting when the next() method returns nil.
ja: 次に、whileループは、そのイテレータのもつnext()メソッドを繰り返し呼び出して、返される各要素をanimalに束縛して、そしてnext()メソッドがnilを返すとき退出します。

source: Next, the function calls the array’s index(before:) method to return the correct position in the passed array.
ja: 次に、関数は配列のindex(before:)メソッドを呼び出すことで渡された配列での正しい位置を返します。

source: No buffering storage is allocated and each traversal step invokes predicate on one or more underlying elements.
ja: バッファするストレージが割り当てられること、そしてひとつひとつ見ていく各処理が１つまたはそれ以上の基盤となる要素上でpredicateを呼び出すことはありません。

source: None
ja: なし

source: Nonnullable—Imported as nonoptionals, whether annotated directly or by inclusion in an annotated region
ja: 非ヌル可能性 — 非オプショナルとしてインポートされます、直接に注釈を付けられようとまたは注釈を付けられた領域の中に包含されようと

source: Note
ja: 注意

source: Note that typedef types aren't assumed to be nonnull, even within audited regions, because they aren't inherently nullable.
ja: typedef型は非ヌルであると仮定されません、監査済み領域内でさえもです、なぜならそれらはそもそもヌル可能でないからです。

source: Note that the Element array is suitably-aligned raw memory.
ja: Element配列は、生のメモリに適切に並べられます。

source: Note: this property need not be implemented by conforming types, it has a default implementation in a protocol extension that just returns self.
ja: 注意：このプロパティは準拠する型で実装される必要はありません、それはプロトコル拡張において初期実装、単にselfを返すものを持ちます。

source: Now that the shorterIndices array holds the indices of the shorter names in the names set, you can use those indices to access elements in the set.
ja: 現在、shorterIndices配列はnames集合の中のより短い名前のインデックスを保持します、あなたはそれらのインデックスを使ってこの集合の要素にアクセスできます。

source: Nullable—Imported as optionals
ja: ヌル可能性 — オプショナルとしてインポートされます

source: Numbers and Basic Values
ja: 数と基本的な値

source: Numeric Protocols
ja: 数に関するプロトコル

source: Object subscripting methods are imported by Swift as methods with double underscores (__) prepended to their base names, rather than as a Swift subscript, if either the getter or setter method is marked as NS_REFINED_FOR_SWIFT.
ja: オブジェクト添え字メソッドは、スウィフトによってメソッドとして二重アンダースコア（__）をそれのベース名の前に付けられてインポートされます、スウィフト添え字としてではなく、もしゲッターとセッターメソッドの両方がNS_REFINED_FOR_SWIFTと印付けされるならば。

source: Objective-C and C Code Customization
ja: Objective-CとCコードのカスタム化

source: Obtain each separate iterator from separate calls to the sequence’s makeIterator() method rather than by copying.
ja: そのシーケンスのもつmakeIterator()メソッドへの独立した呼び出しから独立したイテレータを取得してください、コピーによってではなく。

source: Offsets the given index by the specified distance, or so that it equals the given limiting index.
ja: 与えられたインデックスをこの指定された隔たりで補います、またはそれでそれは与えられた限界インデックスと等しくなります。

source: Offsets the given index by the specified distance.
ja: 与えられたインデックスを指定された間隔で補います。

source: Often, the optimizer can eliminate bounds- and uniqueness-checks within an algorithm, but when that fails, invoking the same algorithm on body\ ’s argument lets you trade safety for speed.
ja: しばしば、最適化機能はアルゴリズム内部で境界および固有さ検査を省くことができます、しかしそれが失敗する時、同じアルゴリズムをbodyの引数上で発動することは、あなたに安全をスピードと交換させます。

source: On This Page
ja: この項には

source: On a big-endian platform, for any integer x, x == x.bigEndian.
ja: ビッグエンディアンプラットホーム上で、何らかの整数xに対して、x == x.bigEndian。

source: On a little-endian platform, for any integer x, x == x.littleEndian.
ja: リトルエンディアンプラットホーム上で、何らかの整数xに対して、x == x.littleEndian。

source: Once nil has been returned, all subsequent calls return nil.
ja: 一旦nilが返されるならば、すべての続いて起こる呼び出しはnilを返します。

source: Once predicate returns false it will not be called again.
ja: いったんpredicateがfalseを返すならそれは再び呼び出されません。

source: Once the predicate returns false it will not be called again.
ja: いったん述部がfalseを返すならそれは再び呼び出されません。

source: Once you migrate a class to Swift, you must remove the corresponding .m file from the target before building to avoid a duplicate symbol error.
ja: 一旦あなたがあるクラスをスウィフトに移行したならば、あなたは、ビルドの前にそのターゲットから対応する.mファイルを取り除いて重複シンボル・エラーを避けなければなりません。

source: One example is the reduce1(_:) method.
ja: １つの例はreduce1(_:)メソッドです。

source: Opaque pointers are used to represent C pointers to types that cannot be represented in Swift, such as incomplete struct types.
ja: 不透明ポインタは、Swiftでは表されることができない型、例えば不完全なstruct型などへのCポインタを表すために使われます。

source: Operator
ja: 演算子

source: Operator Functions
ja: 演算子関数

source: Option Sets
ja: オプションセット

source: Option set values have a one-to-one correspondence with their associated raw values.
ja: オプションセット値それらは、それらの関連する生の値と一対一の対応を持ちます。

source: Option sets all conform to RawRepresentable by inheritance using the OptionSet protocol.
ja: オプションセットすべては、RawRepresentableへの準拠をOptionSetプロトコルを使って継承することによって行います。

source: Option sets use bitwise operations on their associated raw values to implement their mathematical set operations.
ja: オプションセットは、ビット単位演算をそれらの関連する生の値上で使うことで、それらの数学的集合演算を実施します。

source: Option-click a symbol to see implicit information about it, like its type, attributes, and documentation comments.
ja: シンボルをオプション-クリックして、それに関する暗黙表示の情報、その型、属性、そして注釈文書などを見てください。

source: Optional Binding
ja: オプショナル束縛

source: Optional Chaining
ja: オプショナル連鎖

source: Order Dependent Operations on Set
ja: 集合での順序依存演算

source: Other classes derived from such an ancestor are given a default mirror.
ja: そのような先祖から派生する別のクラスは、省略時のミラーを与えられます。

source: Other methods are imported with double underscores (__) prepended to their base names.
ja: 他のメソッドは、二重アンダースコア（__）をそれのベース名の前に付けられてインポートされます。

source: Otherwise, returns (false, oldMember), where oldMember is the member of the set equal to newMember.
ja: そうでなければ、(false, oldMember)を返します、そこでoldMemberはnewMemberに等しいこの集合のメンバです。

source: Otherwise, the result is generated by the language.
ja: そうでなければ、結果は言語によって生成されます。

source: Overflow checking is not performed in -Ounchecked builds.
ja: オーバーフロー検査は、-Ouncheckedビルドでは実行されません。

source: Overview
ja: 概要

source: Parameter: A metatype.
ja: パラメータ：あるメタタイプ。

source: Parameters
ja: パラメータ

source: Parsing of the string is case insensitive.
ja: この文字列の構文解析は、大文字小文字に影響されません。

source: Pass true to request that the collection avoid releasing its storage.
ja: trueを渡して、コレクションがそのストレージを解放するのを回避するよう要求してください。

source: Pass a dictionary literal with string keys as children.
ja: 文字列キーを持つ辞書リテラルをchildrenとして渡してください。

source: Pass a variadic list of string and integer arguments.
ja: 文字列および整数の引数からなる可変長リストを渡してください。

source: Pass an instance to these static methods to acess the layout for that instance's type.
ja: あるインスタンスをこれら静的メソッドに渡すことで、そのインスタンスの持つ型に対するレイアウトにアクセスしてください。

source: Pass the greater-than operator (>) operator as the predicate.
ja: より大きい（>）演算子を述部として渡してください。

source: Passing a sequence with no elements or an empty collection as possiblePrefix always results in true.
ja: １つの要素もないシーケンスまたは空のコレクションをpossiblePrefixとして渡すことは、常にtrueという結果になります。

source: Passing a value that can’t be represented in this type results in a runtime error.
ja: この型において表せない値を渡すことは、実行時エラーという結果になります。

source: Passing the collection’s endIndex as the start parameter results in an empty subsequence.
ja: コレクションのendIndexをstartパラメータとして渡すことは、空のシーケンスという結果になります。

source: Passing the collection’s starting index as the end parameter results in an empty subsequence.
ja: コレクションの開始インデックスをendパラメータとして渡すことは、空のシーケンスという結果になります。

source: Passing the same index as both i and j has no effect.
ja: iとjの両方と同じアンデックスを渡すことは、効果を持ちません。

source: Perform order-dependent operations common to all collections, as implemented for Set.
ja: すべてのコレクションに共通の順序依存演算を、Setに対して実装されたように実行します。

source: Performing Collection Operations
ja: コレクション演算の実行

source: Performing a bitwise NOT operation on 0 returns a value with every bit set to 1.
ja: ビット単位のNOT演算を0に関して実行することは、すべてのビットが1に設定された値を返します。

source: Performs a nil-coalescing operation, returning the wrapped value of an Optional instance or a default Optional value.
ja: nil合体演算を実行します、ラップされた値のOptionalインスタンスまたは省略時のOptional値を返します。

source: Performs a nil-coalescing operation, returning the wrapped value of an Optional instance or a default value.
ja: nil合体演算を実行します、ラップされた値のOptionalインスタンスまたは省略時の値を返します。

source: Playgrounds and the debugger use the Mirror type to display representations of values of any type.
ja: プレイグラウンド及びデバッガは、Mirror型を使ってあらゆる型の値の表現を表示します。

source: Playgrounds and the debugger will show a representation similar to the one used for instances of the kind indicated by the DisplayStyle case name when the mirror is used for display.
ja: プレイグラウンドとデバッガは、DisplayStyleケース節名によって指し示される種類のインスタンスに対して使われるものに似た表現をミラーが表示用に使われる時に示します。

source: Please see LazySequenceProtocol for background; LazyCollectionProtocol is an analogous component, but for collections.
ja: 予備知識としてLazySequenceProtocolをぜひ見てください；LazyCollectionProtocolは、類似した、しかしコレクションのためのコンポーネントです。

source: Precondition: buffer is an instance of a non-@objc class whose deinit destroys its stored Header and any constructed Elements.
ja: 前提条件：bufferは非@objcクラスのインスタンスです、それのdeinitはそれの格納されたHeaderとあらゆる構成されたElementを破棄します。

source: Precondition: maximum must compare equal to itself (i.e. cannot be NaN).
ja: 前提条件：maximumはそれ自身と等しいと比較されなければなりません（すなわちNaNであることはできません）。

source: Precondition: minimum must compare equal to itself (i.e. cannot be NaN).
ja: 前提条件：minimumはそれ自身と等しいと比較されなければなりません（すなわちNaNであることはできません）。

source: Precondition: minimumCapacity >= 0, and the type indicated by bufferClass is a non-@objc class with no declared stored properties.
ja: 前提条件：minimumCapacity >= 0、そしてbufferClassによって示される型が非@objcクラスで宣言された格納プロパティを持たないこと。

source: Precondition: next() has not been applied to a copy of self since the copy was made.
ja: 前提条件：next()がselfのコピーに、そのコピーが作成されて以来まったく適用されていないこと。

source: Precondition: position is a valid position in self and position != endIndex.
ja: 前提条件：positionがselfの中の有効な位置でありposition != endIndexであること。

source: Precondition: scalars must have the same number of elements as the vector type.
ja: 前提条件：scalarsは、ベクター型と同じ数の要素を持たなければなりません。

source: Prepares the collection to store the specified number of elements, when doing so is appropriate for the underlying type.
ja: 指定された数の要素を格納するようにコレクションを準備します、そうすることが基礎をなす型に対して適切である場合には。

source: Preserving the Results of a Throwing Expression
ja: スローする式の結果を保全する

source: Prevent an Objective-C API from Being Imported
ja: あるObjective-C APIがインポートされるのを妨げる

source: Preventing Timing Problems When Using Closures
ja: クロージャを使う場合のタイミング問題を防ぐ

source: Properties are not directly accessible if they trigger any didSet or willSet accessors, perform any representation changes such as bridging or closure reabstraction, or mask the value out of overlapping storage as for packed bitfields.
ja: プロパティは直接にアクセス可能ではありません、もしそれらが何らかのdidSetまたはwillSetアクセッサの引き金になる、何らかの表現変更の実行たとえばブリッジまたはクロージャ再抽象化など、またはオーバーラップしているストレージの外の値をパックされたビットフィールドとしてマスクするならば。

source: Publishing a Result
ja: 結果の発行

source: Publishing a Sequence
ja: あるシーケンスを発行する

source: Publishing an Optional
ja: オプショナルを発行する

source: Querying Descendants
ja: 子孫について問い合わせる

source: Querying Runtime Values
ja: 実行時値の問い合わせ

source: Querying Type Properties
ja: 型プロパティに問い合わせる

source: Random Number Generators
ja: 無作為数生成子

source: Random-access collections can move indices any distance and measure the distance between indices in O(1) time.
ja: 無作為アクセスのコレクションは、任意の隔たりのインデックスを移動できます、そしてインデックス間の隔たりの測定をO(1)時間で行えます。

source: Range Expressions
ja: 範囲式

source: Range-replaceable collections provide operations that insert and remove elements.
ja: 範囲交換可能なコレクションは、いくつかの要素の挿入や削除を行う演算を提供します。

source: RangeReplaceableCollection Implementations
ja: RangeReplaceableCollection 実装

source: Ranges
ja: さまざまな範囲

source: Raw Representation
ja: 生の表現

source: Reference Types
ja: 参照型

source: Relationships
ja: 関係

source: Remember that you can't subclass a Swift class in Objective-C.
ja: あなたがObjective-CにおいてSwiftクラスをサブクラス化できないことを忘れないでください。

source: Remove the original Objective-C .m file from the target by deselecting the target membership checkbox.
ja: ターゲットから本来のObjective-C .mファイルを、ターゲットメンバーシップ・チェックボックスの選択を外すことによって取り除いてください。

source: Removes all elements from the collection.
ja: 全ての要素をコレクションから削除します。

source: Removes all elements of this option set that are not also present in the given set.
ja: このオプションセットに属し、また与えられたセットの中に含まれない、すべての要素を削除します。

source: Removes all members from the set.
ja: 集合からすべてのメンバを削除します。

source: Removes all the elements that satisfy the given predicate.
ja: 与えられた述部を満たす要素すべてを除去します。

source: Removes and returns the element at the specified position.
ja: 指定された位置での要素を削除して返します。

source: Removes and returns the first element of the collection.
ja: コレクションの最初の要素を削除して返します。

source: Removes and returns the first element of the set.
ja: 集合の最初の要素を削除して返します。

source: Removes and returns the last element of the collection.
ja: コレクションの最後の要素を削除して返します。

source: Removes the element at the given index of the set.
ja: 与えられたインデックスでの集合の要素を返します。

source: Removes the elements in the specified subrange from the collection.
ja: 指定された下位範囲の中の要素をコレクションから削除します。

source: Removes the elements of the given sequence from the set.
ja: 与えられたシーケンスの要素を集合から削除します。

source: Removes the elements of the given set from this set.
ja: 与えられた集合の要素をこの集合から削除します。

source: Removes the elements of the set that are also in the given sequence and adds the members of the sequence that are not already in the set.
ja: この集合の要素で与えられたシーケンスの中にもあるものを削除します、そしてシーケンスのメンバで集合の中にはまだないものを加えます。

source: Removes the elements of the set that are also in the given set and adds the members of the given set that are not already in the set.
ja: 与えられた集合の中にもあるこの集合の要素を削除します、そして与えられた集合のメンバでこの集合の中にはまだないものを加えます。

source: Removes the elements of the set that aren’t also in the given sequence.
ja: 与えられたシーケンスの中にはない、この集合の要素を削除します。

source: Removes the elements of this set that aren’t also in the given set.
ja: 与えられた集合の中にはない、この集合の要素を削除します。

source: Removes the first element of the set.
ja: 集合の最初の要素を削除します。

source: Removes the given element and all elements subsumed by it.
ja: 与えられた要素とそれによって包括されるすべての要素を削除します。

source: Removes the given element and any elements subsumed by the given element.
ja: 与えられた要素と、与えられた要素によって包括されるあらゆる要素を削除します。

source: Removes the given number of elements from the end of the collection.
ja: 与えられた数の要素をコレクションの終わりから削除します。

source: Removes the specified element from the set.
ja: 指定された要素を集合から削除します。

source: Removes the specified number of elements from the beginning of the collection.
ja: 指定された数の要素をコレクションの始まりから削除します。

source: Removes the specified number of elements from the end of the collection.
ja: 指定された数の要素をコレクションの終わりから削除します。

source: Removes the specified subrange of elements from the collection.
ja: いくらかの要素からなる指定された下位範囲をコレクションから削除します。

source: Removing Elements
ja: 要素の削除

source: Rename APIs
ja: APIを改名する

source: Renaming Objective-C APIs for Swift
ja: Objective-C APIをSwift用に改名する

source: Reordering Elements
ja: 要素を再配列する

source: Reordering a Sequence’s Elements
ja: あるシーケンスのもつ要素を再配列する

source: Reorders the elements of the collection such that all the elements that match the given predicate are after all the elements that don’t match.
ja: コレクションの要素を再配列します、例えば、与えられた述部にマッチする要素すべてが、合致しない要素すべての後になるなど。

source: Repeated Access
ja: 繰り返してアクセスする

source: Repeatedly calling this method returns, in order, all the elements of the underlying sequence.
ja: 繰り返しこのメソッドを呼び出すことは、基礎をなすシーケンスのすべての要素を、順番に返します。

source: Replace this set with the elements contained in this set or the given set, but not both.
ja: この集合を、この集合または与えられた集合の中に含まれる、しかし両方にではない要素で置き換えます。

source: Replaces elements of this vector with other in the lanes where mask is true.
ja: このベクターの要素を、maskがtrueであるところの、レーンの中のotherで置き換えます

source: Replaces elements of this vector with elements of other in the lanes where mask is true.
ja: このベクターの要素を、maskがtrueであるところの、レーンの中のotherの要素で置き換えます。

source: Replaces the given index with its predecessor.
ja: 与えられたインデックスをそれの前のものと取り替えます。

source: Replaces the given index with its successor.
ja: 与えられたインデックスをそれの後に続くものと取り替えます。

source: Replaces the specified subrange of elements with the given collection.
ja: いくらかの要素からなる指定された下位範囲を与えられたコレクションで置き換えます。

source: Replaces this set with a new set containing all elements contained in either this set or the given set, but not in both.
ja: このセットを、このセットか与えられたセットのどちらかの中に、しかし両方ではなく、含まれるすべての要素を含んでいる新しいセットで置き換えます。

source: Replaces this value with its additive inverse.
ja: この値をそれの加法の逆元で置き換えます。

source: Representing a Result
ja: 結果の表現

source: Required Initializer
ja: 必須イニシャライザ

source: Required.
ja: 必須。

source: Reserves enough space to store the specified number of elements.
ja: 指定された数の要素を格納するのに十分な空間を確保します。

source: Resources
ja: リソース

source: Retaining the collection’s storage can be a useful optimization when you’re planning to grow the collection again.
ja: コレクションのストレージを保持することは、あなたがコレクションをもう一度増大しようと計画している時に、ひとつの有益な最適化であることができます。

source: Retrieve the executor for this actor as an optimized, unowned reference.
ja: エグゼキュータ（遂行者）をこのアクターのためにある最適化された、非所有参照として取って来ます。

source: Return Result Instances Asynchronously
ja: 結果インスタンスを非同期に返す

source: Return Value
ja: 戻り値

source: Return an iterator over the elements of this sequence.
ja: このシーケンスの要素すべてに対するあるイテレータを返します。

source: Returns -1 if this value is negative and 1 if it’s positive; otherwise, 0.
ja: この値が負ならば-1そしてそれが正ならば1；それ以外では0を返します。

source: Returns true if self holds the only strong reference to its buffer; otherwise, returns false.
ja: trueを返します、もしselfがそれのバッファに対する強い参照のみを保持するならば；そうでなければ、falseを返します。

source: Returns true if this value is a multiple of the given value, and false otherwise.
ja: trueをもしこの値がその与えられた値の倍数ならば、そしてfalseをそうでないならば返します。

source: Returns a Decoder instance for decoding super from the container associated with the default super key.
ja: Decoderインスタンスを、superをデコードするために、省略時superキーと結び付けられるコンテナから返します。

source: Returns a Decoder instance for decoding super from the container associated with the given key.
ja: superをデコードするためのDecoderインスタンスを、指定のキーと結び付けられるコンテナから返します。

source: Returns a LazyMapSequence over this Sequence.
ja: このSequenceを覆うLazyMapSequenceを返します。

source: Returns a Boolean value indicating whether a value is included in a range.
ja: 値が範囲に含まれるかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether every element of a sequence satisfies a given predicate.
ja: シーケンスのすべての要素がある与えられた述部を満たすかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether the decoder contains a value associated with the given key.
ja: 与えられたキーと結び付けられた値をデコーダが含むかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether the given element is contained within the range expression.
ja: 与えられた要素がこの範囲式内に含まれるかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether the given element is contained within the range.
ja: 与えられた要素がこの範囲内に含まれるかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether the initial elements of the sequence are equivalent to the elements in another sequence, using the given predicate as the equivalence test.
ja: シーケンスの最初の要素らが別のシーケンスの中の要素らと同等かどうかを、与えられた述部を同等性テストとして使って指し示すブール値を返します。

source: Returns a Boolean value indicating whether the initial elements of the sequence are the same as the elements in another sequence.
ja: シーケンスの最初の要素らが別のシーケンスの中の要素らと同じかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether the sequence contains an element that satisfies the given predicate.
ja: 指定された述部を満足させるある要素をシーケンスが含むかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether the sequence contains the given element.
ja: 指定された要素をシーケンスが含むかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether the sequence precedes another sequence in a lexicographical (dictionary) ordering, using the given predicate to compare elements.
ja: シーケンスが別のシーケンスの前に来るかどうかをある語彙筆記的順序（字典）順序において、与えられた述部を使って要素を比較して、指し示すブール値を返します。

source: Returns a Boolean value indicating whether the sequence precedes another sequence in a lexicographical (dictionary) ordering, using the less-than operator (<) to compare elements.
ja: そのシーケンスが別のシーケンスの前に来るかどうかを、ある語彙筆記的順序（字典）順序において、より小さい演算子（<）を使って要素を比較して、指し示すブール値を返します。

source: Returns a Boolean value indicating whether the two arguments are equal.
ja: ２つの引数が等しいかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether the two arguments are not equal.
ja: ２つの引数が等しくないかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether the two given values are equal.
ja: ２つの与えられた値が等しいかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether the two given values are not equal.
ja: ２つの与えられた値が等しくないかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether the value of the first argument is greater than or equal to that of the second argument.
ja: 最初の引数の値が２番目の引数のそれより大きいまたは等しいかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether the value of the first argument is greater than that of the second argument.
ja: 最初の引数の値が２番目の引数のそれより大きいかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether the value of the first argument is less than or equal to that of the second argument.
ja: 最初の引数の値が２番目の引数のそれより少ないまたは等しいかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether the value of the first argument is less than that of the second argument.
ja: 最初の引数の値が２番目の引数のそれより少ないかどうかを指し示しているブール値を返します。

source: Returns a Boolean value indicating whether this range and the given range contain an element in common.
ja: この範囲と与えられた範囲がある要素を共通に含むかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether this sequence and another sequence contain equivalent elements in the same order, using the given predicate as the equivalence test.
ja: このシーケンスともう一方のシーケンスが同等の要素を同じ順序で含むかどうかを、与えられた述部を同等テストとして使って、指し示しているブール値を返します。

source: Returns a Boolean value indicating whether this sequence and another sequence contain the same elements in the same order.
ja: このシーケンスともう一方のシーケンスが同じ要素を同じ順序で含むかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether two optional instances are equal.
ja: ２つのオプショナルインスタンスが等しいかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether two ranges are equal.
ja: ２つの範囲が等しいかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether two sets have equal elements.
ja: ２つの集合がまったく等しい要素らを持つかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether two types are identical.
ja: ２つの型が同一かどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether two types are not identical.
ja: ２つの型が同一でないかどうかを指し示すブール値を返します。
